---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveWallOffset
source: html/2ab6d83e-69a8-e2ae-ffe4-2763c4325dfa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveWallOffset Property

"Wall offset"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveWallOffset { get; }
```